
&НаКлиенте
Процедура СписокНоменклатурыЦенаПриИзменении(Элемент)
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена * (100 - ТекДанные.ПроцентСкидки)/100;	
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыКоличествоПриИзменении(Элемент)
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена * (100 - ТекДанные.ПроцентСкидки)/100; 
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПроцентСкидкиПриИзменении(Элемент)
	ТекДанные = Элементы.СписокНоменклатуры.ТекущиеДанные;
	ТекДанные.Сумма = ТекДанные.Количество * ТекДанные.Цена * (100 - ТекДанные.ПроцентСкидки)/100;
КонецПроцедуры
